### Concatenaciones de dataframe

concatenar = juntar, unir o fusionar
para dataframe, existen 3 fromas de concatenar:
- Concat (concatenar)
- Merge (fusionar9
- Join (unir)

In [ ]:
# concat
Esta técnica básicamente se centra en bases de datos comunes, le tienen las mismas columnas y por tanto básicamente hay que juntar filas

In [3]:
import pandas as pd

In [4]:
df1= pd.DataFrame ({'A':['1A', '2A'], 'B': ['1B', '2B'], 'C':['1C','2C'], 'K':['1K', '2K'})
df2 = pd.DataFrame ({'A':['6A', '7A','8A'], 'B': ['6B', '7B','8B'], 'C':['6C','7C','8C']})

In [5]:
df1

    A   B   C
0  1A  1B  1C
1  2A  2B  2C

In [6]:
df2

    A   B   C
0  6A  6B  6C
1  7A  7B  7C
2  8A  8B  8C

In [11]:
pd.concat([df1,df2], ignore_index = True)

    A   B   C
0  1A  1B  1C
1  2A  2B  2C
2  6A  6B  6C
3  7A  7B  7C
4  8A  8B  8C

In [ ]:
# Merge (fusionar)
Esta técnica fusiona diferentes Data Frames a partir de una columna (llave) en común.

In [12]:
df1= pd.DataFrame ({'A':['1A', '2A'], 'B': ['1B', '2B']})
df2 = pd.DataFrame ({'A':['1A', '2A'],  'C':['1C','2C'],'K':['1K', '2K']})

In [14]:
pd.merge(df1,df2, on=['A'])

    A   B   C   K
0  1A  1B  1C  1K
1  2A  2B  2C  2K

In [17]:
df1= pd.DataFrame ({'A':['1A', '2A','3A'], 'B': ['1B', '2B','3B']})
df2 = pd.DataFrame ({'A':['5A', '6A'],  'C':['1C','2C'],'K':['1K', '2K']})

In [15]:
pd.merge(df1,df2, on=['A'])

    A   B   C   K
0  1A  1B  1C  1K
1  2A  2B  2C  2K

In [18]:
pd.merge(df1,df2, on=['A'], how = 'outer')

    A    B    C    K
0  1A   1B  NaN  NaN
1  2A   2B  NaN  NaN
2  3A   3B  NaN  NaN
3  5A  NaN   1C   1K
4  6A  NaN   2C   2K

In [19]:
pd.merge(df1,df2, on=['A'], how = 'left')

    A   B    C    K
0  1A  1B  NaN  NaN
1  2A  2B  NaN  NaN
2  3A  3B  NaN  NaN

In [ ]:
# join
La idea de este Data Frame es convinar las columnas de dos dataframes indexados

In [36]:
df1= pd.DataFrame ({'Z':['1A', '2A','3A'], 'B': ['1B', '2B','3B']}, index=['i1','i2','i3'])
df2 = pd.DataFrame ({'A':['5A', '6A'],  'C':['1C','2C'],'K':['1K', '2K']},index=['i1','i2'])

In [37]:
df1

     Z   B
i1  1A  1B
i2  2A  2B
i3  3A  3B

In [38]:
df2

     A   C   K
i1  5A  1C  1K
i2  6A  2C  2K

In [39]:
df1.join(df2)

     Z   B    A    C    K
i1  1A  1B   5A   1C   1K
i2  2A  2B   6A   2C   2K
i3  3A  3B  NaN  NaN  NaN

# Entradas y salidas

In [40]:
df3 = df1.join(df2)
df3

     Z   B    A    C    K
i1  1A  1B   5A   1C   1K
i2  2A  2B   6A   2C   2K
i3  3A  3B  NaN  NaN  NaN

In [46]:
df3.to_csv('nombre.csv', index = False)

In [45]:
pd.read_csv('otra cosa.csv')

  Unnamed: 0   Z   B    A    C    K
0         i1  1A  1B   5A   1C   1K
1         i2  2A  2B   6A   2C   2K
2         i3  3A  3B  NaN  NaN  NaN